Repository: CofficLab/GitOK
Catalog: APP/Plugins/Git-Clone/Git-Clone.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: After saving HTTPS credentials for %@, GitOK will automatically retry the clone. Credentials will be saved via the current Git credential helper.
zh_hans: 为 %@ 保存 HTTPS 凭据后，GitOK 会自动重试 clone。凭据会通过当前 Git credential helper 保存。
zh_hk: 為 %@ 儲存 HTTPS 憑證後，GitOK 會自動重試 clone。憑證會透過當前 Git credential helper 儲存。

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Choose Directory
zh_hans: 选择目录
zh_hk: 選擇目錄

source: Clone
zh_hans: 克隆
zh_hk: 克隆

source: Clone a Git repository from a remote URL and automatically add it to the project list.
zh_hans: 从远程地址克隆一个 Git 仓库，并自动导入到项目列表。
zh_hk: 從遠端地址克隆一個 Git 倉庫，並自動匯入到專案列表。

source: Clone Repository
zh_hans: 克隆仓库
zh_hk: 克隆倉庫

source: Cloned %@
zh_hans: 已克隆 %@
zh_hk: 已克隆 %@

source: Cloning...
zh_hans: 克隆中…
zh_hk: 克隆中…

source: Connect and List Repositories
zh_hans: 连接并列出仓库
zh_hk: 連接並列出倉庫

source: Create Token
zh_hans: 创建 Token
zh_hk: 建立 Token

source: Enter Credentials and Retry
zh_hans: 输入凭据并重试
zh_hk: 輸入憑證並重試

source: Final Path
zh_hans: 最终路径
zh_hk: 最終路徑

source: Git Credentials Required
zh_hans: 需要 Git 凭据
zh_hk: 需要 Git 憑證

source: GitHub / Enterprise Account Clone
zh_hans: GitHub / Enterprise 账号 Clone
zh_hk: GitHub / Enterprise 帳號 Clone

source: GitHub API did not return a valid response
zh_hans: GitHub API 没有返回有效响应
zh_hk: GitHub API 沒有返回有效響應

source: GitHub API request failed (%lld): %@
zh_hans: GitHub API 请求失败 (%lld): %@
zh_hk: GitHub API 請求失敗 (%lld): %@

source: GitHub API URL is invalid
zh_hans: GitHub API 地址无效
zh_hk: GitHub API 地址無效

source: github.com or ghe.example.com
zh_hans: github.com 或 ghe.example.com
zh_hk: github.com 或 ghe.example.com

source: Invalid destination path
zh_hans: 目标路径无效
zh_hk: 目標路徑無效

source: Local Path
zh_hans: 本地路径
zh_hk: 本地路徑

source: No accessible repositories found. Please verify that the token permissions include repo/read:org or corresponding Enterprise permissions.
zh_hans: 未找到可访问仓库。请确认 token 权限包含 repo/read:org 或对应 Enterprise 权限。
zh_hk: 未找到可訪問倉庫。請確認 token 權限包含 repo/read:org 或對應 Enterprise 權限。

source: Personal Access Token or Password
zh_hans: Personal access token 或密码
zh_hk: Personal access token 或密碼

source: Please enter a remote repository URL
zh_hans: 请输入远程仓库地址
zh_hk: 請輸入遠端倉庫地址

source: Ready to Clone
zh_hans: 准备克隆
zh_hk: 準備克隆

source: Remote Repository
zh_hans: 远程仓库
zh_hk: 遠端倉庫

source: Repository cloned locally, but failed to add to project list: %@
zh_hans: 仓库已克隆到本地，但导入项目列表失败：%@
zh_hk: 倉庫已克隆到本地，但匯入專案列表失敗：%@

source: Repository Name
zh_hans: 仓库名称
zh_hk: 倉庫名稱

source: Save and Retry
zh_hans: 保存并重试
zh_hk: 儲存並重試

source: Search Repositories
zh_hans: 搜索仓库
zh_hk: 搜尋倉庫

source: Target directory exists but is empty. Cloning directly into it is allowed.
zh_hans: 目标目录已存在但为空，允许直接克隆到该目录。
zh_hk: 目標目錄已存在但為空，允許直接克隆到該目錄。

source: Token will be saved via the current Git credential helper. Repository list comes from GitHub/GitHub Enterprise API.
zh_hans: Token 会通过当前 Git credential helper 保存，仓库列表来自 GitHub/GitHub Enterprise API。
zh_hk: Token 會透過當前 Git credential helper 儲存，倉庫列表來自 GitHub/GitHub Enterprise API。

source: Username
zh_hans: 用户名
zh_hk: 用戶名

source: View SSH Handling
zh_hans: 查看 SSH 处理方式
zh_hk: 查看 SSH 處理方式

source: Will use: %@
zh_hans: 将使用：%@
zh_hk: 將使用：%@
